Repository: bdegoy/openid-connect-generic
Catalog: languages/openid-connect-generic-*.po
Languages: fr_fr

source: Session expired. Please login again.
fr_fr: Votre session a expiré. Veuillez vous reconnecter.

source: Invalid user
fr_fr: Utilisateur Invalide

source: No appropriate username found
fr_fr: Aucun nom d&#39;utilisateur approprié trouvé

source: User claim incomplete
fr_fr: Déclaration de l'utilisateur incomplète

source: Bad user claim result
fr_fr: Résultat de déclaration d&#39;utilisateur incorrect

source: Can not authorize.
fr_fr: Ne peut pas autoriser.

source: Failed user creation.
fr_fr: Échec de la création d&#39;utilisateur.

source: Missing state.
fr_fr: Etat manquant

source: Request for authentication token failed.
fr_fr: La demande de jeton d&#39;authentification a échoué.

source: Refresh token failed.
fr_fr: Le jeton d&#39;actualisation a échoué.

source: Missing token body.
fr_fr: Corps de jeton manquant.

source: Request for userinfo failed.
fr_fr: La demande d&#39;informations sur l&#39;utilisateur a échoué.

source: No identity token
fr_fr: Pas de jeton d&#39;identité

source: Missing identity token
fr_fr: Jeton d&#39;identité manquant

source: Bad ID token claim
fr_fr: Réclamation de jeton d&#39;identification incorrecte

source: No subject identity
fr_fr: Pas d&#39;identité du sujet

source: Bad user claim
fr_fr: Revendication d&#39;utilisateur incorrect

source: Invalid user claim
fr_fr: Déclaration d&#39;utilisateur non valide

source: Error from the IDP
fr_fr: Erreur du PDI

source: Incorrect user claim
fr_fr: Déclaration d&#39;utilisateur incorrecte

source: ERROR
fr_fr: ERREUR

source: Login with OpenID Connect
fr_fr: Connectez-vous avec OpenID Connect

source: User
fr_fr: Utilisateur

source: Login Type
fr_fr: Type de connexion

source: Select how the client (login form) should provide login options.
fr_fr: Sélectionnez la manière dont le client (formulaire de connexion) doit fournir les options de connexion.

source: OpenID Connect button on login form
fr_fr: Bouton OpenID Connect sur le formulaire de connexion

source: Auto Login - SSO
fr_fr: Connexion automatique - SSO

source: Client ID
fr_fr: identité du client

source: The ID this client will be recognized as when connecting the to Identity provider server.
fr_fr: L&#39;identifiant de ce client sera reconnu lors de la connexion du serveur au fournisseur d&#39;identité.

source: Client Secret Key
fr_fr: Clé secrète du client

source: Arbitrary secret key the server expects from this client. Can be anything, but should be very unique.
fr_fr: Clé secrète arbitraire que le serveur attend de ce client. Peut être n&#39;importe quoi, mais devrait être très unique.

source: OpenID Scope
fr_fr: Portée OpenID

source: Space separated list of scopes this client should access.
fr_fr: Liste séparée par des espaces des portées auxquelles ce client devrait accéder.

source: Login Endpoint URL
fr_fr: URL du point de treminaison de Login

source: Identify provider authorization endpoint.
fr_fr: point de terminaison d'autorisation

source: Userinfo Endpoint URL
fr_fr: URL du point de terminaison Userinfo

source: Identify provider User information endpoint.
fr_fr: Identifiez le point de terminaison informations utilisateur.

source: Token Validation Endpoint URL
fr_fr: URL du point de terminaison de jeton

source: Identify provider token endpoint.
fr_fr: point de terminaison de jeton

source: End Session Endpoint URL
fr_fr: URL du point de terminaison de Fin de session

source: Identify provider logout endpoint.
fr_fr: point de terminaison de déconnexion

source: Identity Key
fr_fr: Clé d'identification

source: Where in the user claim array to find the user's identification data. Possible standard values: preferred_username, name, or sub. If you're having trouble, use "sub".
fr_fr: Où dans le tableau des déclarations de l&#39;utilisateur trouver les données d&#39;identification de l&#39;utilisateur. Valeurs standard possibles: nom d&#39;utilisateur préféré, nom ou sous-utilisateur. Si vous rencontrez des problèmes, utilisez &quot;sub&quot;.

source: Disable SSL Verify
fr_fr: Désactiver SSL Verify

source: Do not require SSL verification during authorization. The OAuth extension uses curl to make the request. By default CURL will generally verify the SSL certificate to see if its valid an issued by an accepted CA. This setting disabled that verification.<br><strong>Not recommended for production sites.</strong>
fr_fr: Ne nécessite pas de vérification SSL lors de l&#39;autorisation. L&#39;extension OAuth utilise curl pour effectuer la demande. Par défaut, CURL vérifiera généralement le certificat SSL pour voir s&#39;il est valide émis par une autorité de certification acceptée. Ce paramètre a désactivé cette vérification. <br> <strong>Non recommandé pour les sites de production.</strong>

source: HTTP Request Timeout
fr_fr: Délai de la requête HTTP dépassé

source: Set the timeout for requests made to the IDP. Default value is 5.
fr_fr: Définissez le délai d&#39;expiration pour les demandes adressées à l&#39;IDP. La valeur par défaut est 5.

source: Enforce Privacy
fr_fr: Appliquer la confidentialité

source: Require users be logged in to see the site.
fr_fr: Exiger que les utilisateurs soient connectés pour voir le site.

source: Alternate Redirect URI
fr_fr: Autre adresse de redirection

source: Provide an alternative redirect route. Useful if your server is causing issues with the default admin-ajax method. You must flush rewrite rules after changing this setting. This can be done by saving the Permalinks settings page.
fr_fr: Fournissez un autre itinéraire de redirection. Utile si votre serveur pose des problèmes avec la méthode admin-ajax par défaut. Vous devez effacer les règles de réécriture après avoir modifié ce paramètre. Cela peut être fait en enregistrant la page des paramètres de permaliens.

source: Nickname Key
fr_fr: Clé du surnom

source: Where in the user claim array to find the user's nickname. Possible standard values: preferred_username, name, or sub.
fr_fr: Où dans le tableau de déclaration des utilisateurs, trouver le surnom de l&#39;utilisateur. Valeurs standard possibles: nom d&#39;utilisateur préféré, nom ou sous-utilisateur.

source: Email Formatting
fr_fr: Format d'Email

source: String from which the user's email address is built. Specify "{email}" as long as the user claim contains an email claim.
fr_fr: Chaîne à partir de laquelle l&#39;adresse de messagerie de l&#39;utilisateur est générée. Spécifiez &quot;{email}&quot; tant que la revendication de l&#39;utilisateur contient une revendication de courrier électronique.

source: Display Name Formatting
fr_fr: Formatage du nom d&#39;affichage

source: String from which the user's display name is built.
fr_fr: Chaîne à partir de laquelle le nom d&#39;affichage de l&#39;utilisateur est construit.

source: Identify with User Name
fr_fr: Identifier avec un nom d&#39;utilisateur

source: If checked, the user's identity will be determined by the user name instead of the email address.
fr_fr: Si cette case est cochée, l&#39;identité de l&#39;utilisateur sera déterminée par le nom d&#39;utilisateur au lieu de l&#39;adresse électronique.

source: State time limit
fr_fr: Durée de vie de state

source: State valid time in seconds. Defaults to 180
fr_fr: Durée de vie de state en secondes. 180 par défaut

source: Link Existing Users
fr_fr: Lier des utilisateurs existants

source: If a WordPress account already exists with the same identity as a newly-authenticated user over OpenID Connect, login as that user instead of generating an error.
fr_fr: Si un compte WordPress existe déjà avec la même identité qu&#39;un utilisateur nouvellement authentifié via OpenID Connect, connectez-vous en tant que cet utilisateur au lieu de générer une erreur.

source: Redirect Back to Origin Page
fr_fr: Redirection vers la page d&#39;origine

source: After a successful OpenID Connect authentication, this will redirect the user back to the page on which they clicked the OpenID Connect login button. This will cause the login process to proceed in a traditional WordPress fashion. For example, users logging in through the default wp-login.php page would end up on the WordPress Dashboard and users logging in through the WooCommerce "My Account" page would end up on their account page.
fr_fr: Une fois l’authentification OpenID Connect réussie, l’utilisateur sera redirigé vers la page sur laquelle il a cliqué sur le bouton de connexion OpenID Connect. Cela entraînera le processus de connexion dans une procédure WordPress traditionnelle. Par exemple, les utilisateurs se connectant via la page par défaut wp-login.php se retrouveraient dans le tableau de bord WordPress et les utilisateurs se connectant via la page &quot;Mon compte&quot; de WooCommerce se retrouveraient sur leur page de compte.

source: Redirect to the login screen session is expired
fr_fr: La redirection vers la session de l&#39;écran de connexion a expiré

source: When enabled, this will automatically redirect the user back to the WordPress login page if their access token has expired.
fr_fr: Lorsque cette option est activée, l&#39;utilisateur sera automatiquement redirigé vers la page de connexion WordPress si son jeton d&#39;accès a expiré.

source: Enable Logging
fr_fr: Activer le journal

source: Very simple log messages for debugging purposes.
fr_fr: Messages de journal très simples à des fins de débogage.

source: Log Limit
fr_fr: Limite de journal

source: Number of items to keep in the log. These logs are stored as an option in the database, so space is limited.
fr_fr: Nombre d&#39;éléments à conserver dans le journal. Ces journaux sont stockés en tant qu&#39;option dans la base de données, de sorte que l&#39;espace est limité.

source: OpenID Connect - Generic Client
fr_fr: OpenID Connect - Client générique

source: OpenID Connect Client
fr_fr: Client OpenID Connect

source: Client Settings
fr_fr: Réglages client

source: WordPress User Settings
fr_fr: Paramètres utilisateur WordPress

source: Authorization Settings
fr_fr: Paramètres d&#39;autorisation

source: Log Settings
fr_fr: Réglages Journal

source: Redirect URI
fr_fr: URI de redirection

source: Login Button Shortcode
fr_fr: Shortcode du Bouton de connexion

source: Logs
fr_fr: Journaux

source: Example
fr_fr: Exemple

source: Enter your OpenID Connect identity provider settings
fr_fr: Entrez vos paramètres de fournisseur d&#39;identité OpenID Connect

source: Modify the interaction between OpenID Connect and WordPress users
fr_fr: Modifier l&#39;interaction entre les utilisateurs OpenID Connect et WordPress

source: Control the authorization mechanics of the site
fr_fr: Contrôler les mécanismes d&#39;autorisation du site

source: Log information about login attempts through OpenID Connect Generic
fr_fr: Enregistrer les informations sur les tentatives de connexion via OpenID Connect Generic

source: oidcclient:serveur_url
fr_fr: URL du serveur

source: oidcclient:client_id
fr_fr: ID du client

source: oidcclient:login_wp
fr_fr: Login WP

source: oidcclient:nom_auteur
fr_fr: Nom WP

source: oidcclient:session_connected_no
fr_fr: Se connecter globalement par OpenID Connect

source: oidcclient:session_connected_yes
fr_fr: La session OpenID Connect est ouverte.<br/>Voulez-vous effectuer une déconnexion globale de toutes vos applications

source: oidcclient:session_connected_error
fr_fr: Erreur de connexion au serveur OIDC.

source: oidcclient:session_open
fr_fr: Ouvrir une session

source: oidcclient:session_extend
fr_fr: Prolonger la session

source: oidcclient:session_close
fr_fr: Clore la session

source: oidcclient:session_expires
fr_fr: Votre session globale OpenID Connect va expirer bientôt.<br/>Voulez-vous la prolonger

source: oidcclient:item_yes
fr_fr: oui

source: oidcclient:item_no
fr_fr: non

source: oidcclient:t_session_restant
fr_fr: Temps de session restant

source: oidcclient:delai_reponse
fr_fr: délai de réponse

source: oidcclient:lbl_infos_titre
fr_fr: Informations sur OIDC
